spec/dummy/app/grids/complex_post_grid.rb

  scope { Post.includes(:user) }

  filter :title, label: "Search Title"
  filter :created_at, type: :date_range, label: "Created Date"
  filter :user_id, type: :select, collection: -> { User.pluck(:name, :id) }, label: "Author"
---
SELECT "users"."name", "users"."id" FROM "users"